#include <stdio.h>

/// 数组的写法

// 数组 是一个能连续存放多个 相同类型 的数据结构

// 数组的定义
int arr[5] = {1,2,3,4,5};

// arr是数组名 5是长度(最多能存5个int) 元素下表从0开始

// 初始化的几种写法
int a[5] = {1,2,3,4,5}; // 完整初始化
int b[5] = {1,2}; // 前两个为2其余自动补0
int c[5] = {0}; // 全部初始化为0
int d[] = {1,2,3,4,5}; // 省略长度编译器自动推算

/// 局部数组如果不初始化,里面的值是随机垃圾值


/// 遍历数组的方式

int main() {
    int scores[] = {90,80,99,79,87,57,70,88,70,68};
    int N = sizeof(scores) / sizeof(scores[0]); // sizeof(scores)可以获得数组的占用大小,除于其中一个元素就能得到总长度
    int sum = 0; // 累加器
    int max = scores[0]; // 先假设第一个元素是最大值,之后遇到更大的就更换
    for (int i = 0;i < N;i++) { // 循环整个数组
        sum += scores[i]; // 把当前循环到的成绩加入总分
        if (scores[i] > max) { // 如果当前分数比max大就替换为max
            max = scores[i];
        }
    }
    printf("总分 %d，平均分 %.1f，最高分 %d\n", sum, (double)sum / N, max);


    // 拓展:数组的越界
    int e[3] = {1,2,3};
    // e[3] = 100; // 合法下标只有 0 1 2 3越界了
    return 0;
}
