#include <stdio.h>

/// 指针:存放地址的变量


int main(void) {
    // 1.内存与地址
    // 内存就像一排排小格子,每个格子能存一字节的数据 每个格子都有自己的编号 就是地址 通过 &变量名 可以获取地址

    int x = 100;
    int *p = &x;    // p 是指向int的指针 保存x的地址
    char c = 'a';
    char *char_p = &c; // 指向char的指针 保存c的地址
    printf("x的地址是:%p\n",(void *)p);
    printf("通过p访问x的值:%d\n",*p);

    *p = 200; // *p 指向 x的值 可以直接修改x
    printf("x修改后的值:%d",x);

    // 2.两个关键符号
    //     | 符号  | 名称  |          作用        | 例子   |
    //     |   &  | 取地址 | 得到变量的地址         |  &x  |
    //     |   *  | 解引用 | 访问指针所指向的那个变量 |  *p  |

    // 声明时 int *p 表示 p是一个指针 指向int
    // 使用时 *p = 20 表示 p所指向的那个变量


    return 0;
}  