#include <stdio.h>

/// 常量的输出

/// 常量:在程序执行过程中,其值不能发生改变的数据
/// 整型常量:正数,负数,0
/// 实型常量:所有带小数点的数字
/// 字符常量:单引号引起来的字母,数字,英文符号,里面只能有一个
/// 字符串常量:双引号引起来的任意文本

/* 补充:
 * 1.实型常量前后为0,0可以不写 .93 等同于 0.93  18. 等同于 18.0(不常写)
 * 2. 科学计数法是实型常量,但是必须要写E
 */

// /* 输出常量:
//  * 语法 : printf(输出样式,输出内容)
//  * 1.输出样式是C语言规定好的格式控制符(占位符)
//  * 整型: %d
//  * 实型: %f
//  * 字符: %c
//  * 字符串: %s
//  *
//  * 拓展:
//  * 1.输出多个常量(使用多个占位符,后面依次填入要输出的常量一一对应)
//  * 2.输出换行要使用换行符(Windows:\r\n Mac:\r Linux:\n)
//  *
//  */

int main() {
    // 输出整数
    printf("%d",18);
    // 输出小数
    printf("%f",3.14);
    // 输出字符
    printf("%c",'A');
    // 输出字符串
    printf("Hello World");
    printf("你好世界的英文翻译为:%s","Hello World");

    // 拓展:
    // 1.输出多个常量
    printf("我叫:%s,我来自:%s,我的年龄为:%d,我这次考试分数为:%f分","xiao","HuBei",18,459.9);
    // 2.换行输出
    printf("Hello\r\n"); // \r 是指回到这一行的行首 \n 是指换行
    printf("World\n");
    printf("End"); // \n 也能换行,是\r\n 的简写
    return 0;
}






























