#include <stdio.h>

/// 变量的使用

/// 变量是在程序中保存数据的
/// 变量中的值是可以修改的
/// 定义格式: 数据类型 变量名;
/// 数据类型是限制变量中存储的类型

// 变量的使用
// 1.先定义在赋值
// 2.数据类型 变量名 = 数据值;




int main() {
    // 变量可以参与输出
    // 定义一个变量
    int a = 10;
    int b = 20;
    int c = a + b; // 变量可以参与计算
    printf("%d\n",a);
    printf("%d\n",b);
    printf("%d\n",c);
    printf("%d\n",a + b);
    c = c + 10;
    printf("%d\n",c);

    // 变量的注意事项:
    // 1.变量中只能存一个值
    int a_1 = 10;
    printf("修改前的a_1:%d\n",a_1);
    a_1 = 20;
    printf("修改后的a_1: %d\n",a_1);

    // 2.变量名不可以重复定义

    // 3.一条语句可以定义多个变量
    int b_1 = 10,c_1 = 20,d_1 = 20;
    printf("%d\n",b_1);
    printf("%d\n",c_1);
    printf("%d\n",d_1);

    // 4.变量在使用前要赋值

    // 5.变量的作用范围


    return 0;
}











































